//*************************************************************************************************
// 内容:	事件类型
//---------------------------------------------------------
// 作者:		
// 创建:		2012-08-27
// 最后修改:
//*************************************************************************************************
#pragma once
#ifndef _SD_GAMECORE_EVENTTYPE_H__
#define _SD_GAMECORE_EVENTTYPE_H__
#include "sdGameCore.h"

namespace GameCore
{
	// 所有事件类型
	enum eEventID
	{

		// 事件数量
		NUM_EVENTS,
	};
}
#endif