//*************************************************************************************************
// 内容:	事件类型
//---------------------------------------------------------
// 作者:		
// 创建:		2012-08-27
// 最后修改:
//*************************************************************************************************
#pragma once
#ifndef _SD_GAMECORE_EVENTHANDLE_H__
#define _SD_GAMECORE_EVENTHANDLE_H__
#include "sdGameCore.h"
#include "sdEventArg.h"

namespace GameCore
{
	//*************************************************************************
	// 事件处理函数接口
	class sdEventHandle
	{
	public:
		virtual ~sdEventHandle() {}
		virtual bool operator()(const stEventArg& pkEventArg) = 0;
	};

	//*************************************************************************
	// 成员函数事件处理者

}
#endif