//*************************************************************************************************
// 内容:	所有着色器的公共变量/宏定义/函数
//			这里是函数部分
//---------------------------------------------------------
// 作者:		
// 创建:		2012-07-10
// 最后修改:
//*************************************************************************************************
#ifndef _COMMON_FUNCTION_H__
#define _COMMON_FUNCTION_H__

//*****************************************************************************
// 深度压缩/法线压缩
//*****************************************************************************
float2 PackNormal(float3 normal)
{
	float f = sqrt(dot(float2(-normal.z, 1.0f), float2(8.0f, 8.0f)));
	return normal.xy / f + 0.5f;
}
//-----------------------------------------------------------------------------
float3 UnpackNormal(float2 enc)
{
	float2	fenc 	= enc * 4.0f - 2.0f;
	float	f		= dot(fenc, fenc);
	float 	g 		= sqrt(1.0f - f / 4.0f);
	float3	normal	= float3(fenc * g, f * 0.5f - 1.0f);
	return normal;
}
//-----------------------------------------------------------------------------
float2 PackDepth(float depth)
{
	float depth_int, depth_frac;
	depth_frac = modf(sqrt(depth) * 256.0f, depth_int);
	return float2(depth_int / 255.0f, depth_frac);
}
//-----------------------------------------------------------------------------
float UnpackDepth(float2 enc)
{
	float depth = dot(enc.xy, float2(255.0f, 1.0f)) * (1.0f / 256.0f);
	depth = depth * depth;
	return depth;
}
//*****************************************************************************
#endif