//*************************************************************************************************
// 内容:	相机状态
//---------------------------------------------------------
// 作者:		
// 创建:		2012-07-30
// 最后修改:
//*************************************************************************************************
#pragma once
#ifndef _CAMERA_STATE_H__
#define _CAMERA_STATE_H__
#include <sdFSM.h>

namespace GameCore
{

	//*************************************************************************
	class sdCameraState : public Base::sdState
	{
	public:
		virtual void Reset(){};
	};

	//*************************************************************************
	class sdCameraFreeState : public sdCameraState
	{
	public:
		sdCameraFreeState();
		~sdCameraFreeState();

		// 虚函数继承
		virtual int Update();
	};
	//*************************************************************************
}
#endif