//*************************************************************************************************
// 内容:	lua文件加载与保存,通过Lua解释器来执行
//---------------------------------------------------------
// 作者:		
// 创建:		2012-09-05
// 最后修改:
//*************************************************************************************************
#pragma once
#ifndef _SD_ENGINE_SCRIPT_LUA_FILE_H__
#define _SD_ENGINE_SCRIPT_LUA_FILE_H__
#include "sdEngine.h"

extern "C"
{
	#include "lua.h"
	#include "lualib.h"
	#include "lauxlib.h"
}

#endif